//SENDSPLU JOB (ACCT),'SEND SPLUNK',CLASS=A,MSGCLASS=X,NOTIFY=&SYSUID
//* Example JCL to execute the REXX script
//STEP1   EXEC PGM=IRXJCL,PARM='SEND_SPLUNK_DATA'
//SYSEXEC DD DISP=SHR,DSN=USER.REXX.LIB
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD *
  %SEND_SPLUNK_DATA
/*
